# Напишите программу, которая будет преобразовывать десятичное число в двоичное.

import random
i = random.randint(0, 100)
print(i)
print(bin(i)[2:])
